In [228]:
import numpy as np
import pandas as pd
import itertools
import functools

In [229]:
import string

In [230]:
letters=list(string.ascii_lowercase)

In [231]:
df1 =  pd.DataFrame({
    'id':list(range(1,25))
     ,
    'gender':list(np.repeat(['Male','Female'],repeats=12))
    ,
    'grp1':[j for i ,j in zip(range(24),itertools.cycle(['A','B','C']))]
    ,
    'grp2':list(np.repeat(['H','H','L','L'],repeats=3))*2
    #[*np.array(['H','L']).repeat(6)]*2
    ,
    'h':[16,17,16,12,17,16,
         17,18,19,19,20,19
        ,14,13,16,12,17,15
         ,17,18,16,18,16,17
        ]
    ,
    'w':[2.5,3,2.1,1.7,4.3,4.7
        ,5.1,4.8,6.4,6.3,8.5,5.5
        ,7.3,8.2,6.4,7.7,7.6,4.4
         ,6.1,6.7,5.2,6.7,5.4,6.3
        ]
    
})

In [232]:
df1.head(3)

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
2   3   Male    C    H  16  2.1

In [233]:
df1.shape

(24, 6)

In [234]:
df1.gender[1:3]

1    Male
2    Male
Name: gender, dtype: object

In [235]:
df1['gender'][1:3]

1    Male
2    Male
Name: gender, dtype: object

In [236]:
df1[['id','gender']][1:3]

   id gender
1   2   Male
2   3   Male

In [237]:
df1[['gender','id']][0:3]

  gender  id
0   Male   1
1   Male   2
2   Male   3

In [238]:
df1[['gender','id']].shape

(24, 2)

In [239]:
df1[0:3]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
2   3   Male    C    H  16  2.1

In [240]:
df1[0:7:2]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1
4   5   Male    B    H  17  4.3
6   7   Male    A    L  17  5.1

In [241]:
df1[slice(0,7,2)]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1
4   5   Male    B    H  17  4.3
6   7   Male    A    L  17  5.1

In [242]:
x=slice(0,10,2);type(x)

slice

In [243]:
df1[0:2]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0

In [244]:
df1.loc[[0]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5

In [245]:
df1.loc[[0,2]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1

In [246]:
df1.loc[[0,2],['gender','h']]

  gender   h
0   Male  16
2   Male  16

In [247]:
df1.loc[[0,2],['gender','h','id']]

  gender   h  id
0   Male  16   1
2   Male  16   3

In [248]:
df1.loc[[0,2],'id':'grp2']

   id gender grp1 grp2
0   1   Male    A    H
2   3   Male    C    H

In [249]:
df1.loc[df1["id"] < 3, "grp1"]

0    A
1    B
Name: grp1, dtype: object

In [250]:
df1.iloc[[0]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5

In [251]:
df1.iloc[[0,2]]

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
2   3   Male    C    H  16  2.1

In [252]:
df1.iloc[[0,2], 0]

0    1
2    3
Name: id, dtype: int64

In [253]:
df1.iloc[[0,2], [0,3]]

   id grp2
0   1    H
2   3    H

In [254]:
df1.iloc[[0,2,5], [0,3,1]]

   id grp2 gender
0   1    H   Male
2   3    H   Male
5   6    H   Male

In [255]:
df1.iloc[0:3, 2:4]

  grp1 grp2
0    A    H
1    B    H
2    C    H

In [256]:
df1.at[0,'id']

1

In [257]:
df1.at[1,'gender']

'Male'

In [258]:
df1.iat[0,0]

1

In [259]:
df1.iat[1,1]

'Male'

In [260]:
df1.dtypes

id          int64
gender     object
grp1       object
grp2       object
h           int64
w         float64
dtype: object

In [261]:
df1.columns

Index(['id', 'gender', 'grp1', 'grp2', 'h', 'w'], dtype='object')

In [262]:
df1[df1['grp1'].isin(['A','B','D'])].head(3)

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
3   4   Male    A    H  12  1.7

In [263]:
df1.columns.isin(['id','grp1','grp2'])

array([ True, False,  True,  True, False, False])

In [264]:
df1.columns[df1.columns.isin(['grp1','id'])]

Index(['id', 'grp1'], dtype='object')

In [265]:
df1[df1.columns[df1.columns.isin(['grp1','id'])]].head(3)

   id grp1
0   1    A
1   2    B
2   3    C

In [266]:
df1[pd.Index(['grp1','id'])].head(3)

  grp1  id
0    A   1
1    B   2
2    C   3

In [267]:
df1[df1["grp1"].notna()].head(3)

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
2   3   Male    C    H  16  2.1

In [268]:
df1[df1["grp1"].notnull()].head(3)

   id gender grp1 grp2   h    w
0   1   Male    A    H  16  2.5
1   2   Male    B    H  17  3.0
2   3   Male    C    H  16  2.1

In [269]:
df1['hw']=df1['h']*df1['w']

In [270]:
df1.head(3)

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6

In [271]:
df1.rename(
    columns={
        "id": "id2",
        "gender": "gen"
    }
).head(3)

   id2   gen grp1 grp2   h    w    hw
0    1  Male    A    H  16  2.5  40.0
1    2  Male    B    H  17  3.0  51.0
2    3  Male    C    H  16  2.1  33.6

In [272]:
df1.head(3)

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6

In [273]:
df1[["h", "w"]].median()

h    17.0
w     5.8
dtype: float64

In [274]:
df1.agg(
    {
        "h": ["min", "max", "median", "skew"],
        "w": ["min", "max", "median", "mean"],
    }
)

                h       w
min     12.000000  1.7000
max     20.000000  8.5000
median  17.000000  5.8000
skew    -0.668276     NaN
mean          NaN  5.5375

In [275]:
#df1.groupby("gender").mean() # error
df1.groupby("gender").mean(numeric_only=True)

          id          h      w      hw
gender
Female  18.5  15.750000  6.500  101.70
Male     6.5  17.166667  4.575   81.85

In [276]:
df1[['gender', 'h', 'w','hw']].groupby("gender").mean()

                h      w      hw
gender
Female  15.750000  6.500  101.70
Male    17.166667  4.575   81.85

In [277]:
df1[['gender','grp1', 'h', 'w','hw']].groupby(['gender','grp1']).mean()

                 h      w       hw
gender grp1
Female A     15.25  6.950  104.725
       B     16.00  6.975  110.700
       C     16.00  5.575   89.675
Male   A     16.00  3.900   66.700
       B     18.00  5.150   95.125
       C     17.50  4.675   83.725

In [278]:
df1["gender"].value_counts()

Male      12
Female    12
Name: gender, dtype: int64

In [279]:
df1.count()

id        24
gender    24
grp1      24
grp2      24
h         24
w         24
hw        24
dtype: int64

In [280]:
df1.groupby(['gender']).count()

        id  grp1  grp2   h   w  hw
gender
Female  12    12    12  12  12  12
Male    12    12    12  12  12  12

In [281]:
df1.groupby(['gender','grp1']).count()

             id  grp2  h  w  hw
gender grp1
Female A      4     4  4  4   4
       B      4     4  4  4   4
       C      4     4  4  4   4
Male   A      4     4  4  4   4
       B      4     4  4  4   4
       C      4     4  4  4   4

In [282]:
df1.value_counts().head(3)

id  gender  grp1  grp2  h   w    hw
1   Male    A     H     16  2.5  40.0    1
2   Male    B     H     17  3.0  51.0    1
23  Female  B     L     16  5.4  86.4    1
dtype: int64

In [283]:
df1['gender'].value_counts()

Male      12
Female    12
Name: gender, dtype: int64

In [284]:
df1['grp2'].value_counts()

H    12
L    12
Name: grp2, dtype: int64

In [285]:
df1.sort_values(by="hw").head()

    id  gender grp1 grp2   h    w    hw
3    4    Male    A    H  12  1.7  20.4
2    3    Male    C    H  16  2.1  33.6
0    1    Male    A    H  16  2.5  40.0
1    2    Male    B    H  17  3.0  51.0
17  18  Female    C    H  15  4.4  66.0

In [286]:
df1.sort_values(by="hw",ascending=False).head()

    id  gender grp1 grp2   h    w     hw
10  11    Male    B    L  20  8.5  170.0
16  17  Female    B    H  17  7.6  129.2
8    9    Male    C    L  19  6.4  121.6
21  22  Female    A    L  18  6.7  120.6
19  20  Female    B    L  18  6.7  120.6

In [287]:
df1.sort_values(by=['h','hw'],ascending=False).head()

    id  gender grp1 grp2   h    w     hw
10  11    Male    B    L  20  8.5  170.0
8    9    Male    C    L  19  6.4  121.6
9   10    Male    A    L  19  6.3  119.7
11  12    Male    C    L  19  5.5  104.5
19  20  Female    B    L  18  6.7  120.6

In [288]:
df1.sort_values(by=['h','gender'],ascending=False).head()

    id gender grp1 grp2   h    w     hw
10  11   Male    B    L  20  8.5  170.0
8    9   Male    C    L  19  6.4  121.6
9   10   Male    A    L  19  6.3  119.7
11  12   Male    C    L  19  5.5  104.5
7    8   Male    B    L  18  4.8   86.4

In [289]:
no2 = df1[df1["gender"] == "Male"];no2.head()

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6
3   4   Male    A    H  12  1.7  20.4
4   5   Male    B    H  17  4.3  73.1

In [290]:
df1['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [291]:
df1[['gender','grp1']].unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [292]:
distinct1=df1[['gender','grp1']].groupby(['gender','grp1']).count();distinct1

Empty DataFrame
Columns: []
Index: [(Female, A), (Female, B), (Female, C), (Male, A), (Male, B), (Male, C)]

In [293]:
pd.DataFrame(distinct1)

Empty DataFrame
Columns: []
Index: [(Female, A), (Female, B), (Female, C), (Male, A), (Male, B), (Male, C)]

In [294]:
pd.DataFrame(distinct1).reset_index()

   gender grp1
0  Female    A
1  Female    B
2  Female    C
3    Male    A
4    Male    B
5    Male    C

In [295]:
df1.pivot_table(columns=['gender'],values='h')

gender  Female       Male
h        15.75  17.166667

In [296]:
df1.pivot_table(columns=['gender'],values='h',aggfunc='sum')

gender  Female  Male
h          189   206

In [297]:
df1.pivot_table(columns=['gender'],values='h',aggfunc=lambda x: sum(x))

gender  Female  Male
h          189   206

In [298]:
df1.pivot_table(columns=['gender','grp1'],values='h')

gender Female              Male
grp1        A     B     C     A     B     C
h       15.25  16.0  16.0  16.0  18.0  17.5

In [299]:
df1.pivot_table(index=['gender'],columns=['grp1'],values='h')

grp1        A     B     C
gender
Female  15.25  16.0  16.0
Male    16.00  18.0  17.5

In [300]:
df2=df1.pivot_table(index=['gender','grp2'],columns=['grp1'],values='h',aggfunc=lambda x: min(x))
df2

grp1          A   B   C
gender grp2
Female H     12  13  15
       L     17  16  16
Male   H     12  17  16
       L     17  18  19

In [301]:
df2.reset_index()

grp1  gender grp2   A   B   C
0     Female    H  12  13  15
1     Female    L  17  16  16
2       Male    H  12  17  16
3       Male    L  17  18  19

In [302]:
df1.head(4)

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6
3   4   Male    A    H  12  1.7  20.4

In [303]:
df2=df1.pivot_table(index=['gender','grp2'],columns=['grp1'],values='h',aggfunc=lambda x: min(x))
df2=df2.reset_index()
df2.head()

grp1  gender grp2   A   B   C
0     Female    H  12  13  15
1     Female    L  17  16  16
2       Male    H  12  17  16
3       Male    L  17  18  19

In [304]:
df2['grp1']

KeyError: 'grp1'

In [305]:
df2.columns

Index(['gender', 'grp2', 'A', 'B', 'C'], dtype='object', name='grp1')

In [306]:
df2.columns.name

'grp1'

In [307]:
df2.columns.name=None

In [308]:
df2.head()

   gender grp2   A   B   C
0  Female    H  12  13  15
1  Female    L  17  16  16
2    Male    H  12  17  16
3    Male    L  17  18  19

In [309]:
df2=df1.pivot_table(index=['gender','grp2'],columns=['grp1'],values='h',aggfunc=lambda x: min(x))
df2=df2.reset_index()
df2.columns.name=None
df2.head()

   gender grp2   A   B   C
0  Female    H  12  13  15
1  Female    L  17  16  16
2    Male    H  12  17  16
3    Male    L  17  18  19

In [ ]:
#### pivot wider and pivot longer

In [387]:
dff1={'id':['student_1','student_2','student_3','student_4'],'Statistics':[17.5,19.5,16.5,18.5],'Math':[15,18,13,19]}

In [388]:
dff1=pd.DataFrame(dff1)

In [389]:
dff1

          id  Statistics  Math
0  student_1        17.5    15
1  student_2        19.5    18
2  student_3        16.5    13
3  student_4        18.5    19

In [448]:
type(dff1)

pandas.core.frame.DataFrame

In [449]:
dff1.columns

Index(['id', 'Statistics', 'Math'], dtype='object')

In [450]:
dff2=dff1.melt(id_vars='id',value_name='score',var_name='course')
dff2

          id      course  score
0  student_1  Statistics   17.5
1  student_2  Statistics   19.5
2  student_3  Statistics   16.5
3  student_4  Statistics   18.5
4  student_1        Math   15.0
5  student_2        Math   18.0
6  student_3        Math   13.0
7  student_4        Math   19.0

In [451]:
dff3=dff2.pivot(index='id',columns='course')
dff3

          score
course     Math Statistics
id
student_1  15.0       17.5
student_2  18.0       19.5
student_3  13.0       16.5
student_4  19.0       18.5

In [430]:
type(dff3)

pandas.core.frame.DataFrame

In [431]:
dff3.columns

MultiIndex([('score',       'Math'),
            ('score', 'Statistics')],
           names=[None, 'course'])

In [432]:
dff3.columns = dff3.columns.droplevel(0)

In [434]:
dff3['id']=dff3.index
dff3.reset_index(inplace=True, drop=True)
#dff3.reset_index()

In [435]:
dff3

course  Math  Statistics         id
0       15.0        17.5  student_1
1       18.0        19.5  student_2
2       13.0        16.5  student_3
3       19.0        18.5  student_4

In [436]:
dff3.columns

Index(['Math', 'Statistics', 'id'], dtype='object', name='course')

In [437]:
dff3.columns.name=''

In [438]:
dff3

   Math  Statistics         id
0  15.0        17.5  student_1
1  18.0        19.5  student_2
2  13.0        16.5  student_3
3  19.0        18.5  student_4

In [439]:
dff3.columns

Index(['Math', 'Statistics', 'id'], dtype='object', name='')

In [441]:
df1.head()

   id gender grp1 grp2   h    w    hw
0   1   Male    A    H  16  2.5  40.0
1   2   Male    B    H  17  3.0  51.0
2   3   Male    C    H  16  2.1  33.6
3   4   Male    A    H  12  1.7  20.4
4   5   Male    B    H  17  4.3  73.1

In [468]:
df4={'grp':['A','A','A','B','B','B'],'value':[12,13,15,16,19,20]}

In [469]:
df4=pd.DataFrame(df4)

In [470]:
df4

  grp  value
0   A     12
1   A     13
2   A     15
3   B     16
4   B     19
5   B     20

In [471]:
df4.shape[0]

6

In [501]:
ids=['student_'+str(i+1)  for i in range(3)]
ids=ids*2

In [502]:
df4['id']=ids
df4

  grp  value         id
0   A     12  student_1
1   A     13  student_2
2   A     15  student_3
3   B     16  student_1
4   B     19  student_2
5   B     20  student_3

In [503]:
df5=df4[[ 'id','grp','value']]
df5

          id grp  value
0  student_1   A     12
1  student_2   A     13
2  student_3   A     15
3  student_1   B     16
4  student_2   B     19
5  student_3   B     20

In [504]:
df4.pivot(index='id',columns='grp')

          value
grp           A   B
id
student_1    12  16
student_2    13  19
student_3    15  20

In [505]:
df3.pivot_table(columns=['gender'], values='h')

gender  Female       Male
h        15.75  17.166667

In [509]:
df3.head()

  gender   h
0   Male  16
1   Male  17
2   Male  16
3   Male  12
4   Male  17

In [507]:
df3.melt(id_vars=['gender'])

    gender variable  value
0     Male        h     16
1     Male        h     17
2     Male        h     16
3     Male        h     12
4     Male        h     17
5     Male        h     16
6     Male        h     17
7     Male        h     18
8     Male        h     19
9     Male        h     19
10    Male        h     20
11    Male        h     19
12  Female        h     14
13  Female        h     13
14  Female        h     16
15  Female        h     12
16  Female        h     17
17  Female        h     15
18  Female        h     17
19  Female        h     18
20  Female        h     16
21  Female        h     18
22  Female        h     16
23  Female        h     17

In [187]:
df1.sort_values('gender')

    id  gender grp1 grp2   h    w     hw
23  24  Female    C    L  17  6.3  107.1
21  22  Female    A    L  18  6.7  120.6
20  21  Female    C    L  16  5.2   83.2
19  20  Female    B    L  18  6.7  120.6
18  19  Female    A    L  17  6.1  103.7
17  18  Female    C    H  15  4.4   66.0
16  17  Female    B    H  17  7.6  129.2
15  16  Female    A    H  12  7.7   92.4
14  15  Female    C    H  16  6.4  102.4
13  14  Female    B    H  13  8.2  106.6
12  13  Female    A    H  14  7.3  102.2
22  23  Female    B    L  16  5.4   86.4
0    1    Male    A    H  16  2.5   40.0
9   10    Male    A    L  19  6.3  119.7
8    9    Male    C    L  19  6.4  121.6
7    8    Male    B    L  18  4.8   86.4
6    7    Male    A    L  17  5.1   86.7
5    6    Male    C    H  16  4.7   75.2
4    5    Male    B    H  17  4.3   73.1
3    4    Male    A    H  12  1.7   20.4
2    3    Male    C    H  16  2.1   33.6
1    2    Male    B    H  17  3.0   51.0
10  11    Male    B    L  20  8.5  170.0
11  12    Male    C    L  19  5.5  104.5

In [186]:
df2.melt(id_vars=['gender','grp2'], value_name='h').sort_values('gender')

    gender grp2 variable   h
0   Female    H        A  12
1   Female    L        A  17
4   Female    H        B  13
5   Female    L        B  16
8   Female    H        C  15
9   Female    L        C  16
2     Male    H        A  12
3     Male    L        A  17
6     Male    H        B  17
7     Male    L        B  18
10    Male    H        C  16
11    Male    L        C  19

In [188]:
df1.melt(id_vars=['gender','grp1','grp2'],value_vars='h')

    gender grp1 grp2 variable  value
0     Male    A    H        h     16
1     Male    B    H        h     17
2     Male    C    H        h     16
3     Male    A    H        h     12
4     Male    B    H        h     17
5     Male    C    H        h     16
6     Male    A    L        h     17
7     Male    B    L        h     18
8     Male    C    L        h     19
9     Male    A    L        h     19
10    Male    B    L        h     20
11    Male    C    L        h     19
12  Female    A    H        h     14
13  Female    B    H        h     13
14  Female    C    H        h     16
15  Female    A    H        h     12
16  Female    B    H        h     17
17  Female    C    H        h     15
18  Female    A    L        h     17
19  Female    B    L        h     18
20  Female    C    L        h     16
21  Female    A    L        h     18
22  Female    B    L        h     16
23  Female    C    L        h     17

In [ ]:
df2.melt(id_vars=['grp2','gender'],value_vars='grp1')